fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.ВКМ_СтатусЗаявкиНаОбслуживание</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ПредоставленнаяУслуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВКМ_СтатусЗаявкиНаОбслуживание/ВКМ_СтатусЗаявкиНаОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_СтатусЗаявкиНаОбслуживание</name>
  <enumValues>
    <name>ОжидаетсяВыполнениеРабот</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаВыполнена</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

	Перем СообщениеТелеграммБоту;  

#КонецОбласти

#Область ОбработчикиСобытий	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		СтатусЗаявки = Перечисления.ВКМ_СтатусЗаявкиНаОбслуживание.ОжидаетсяВыполнениеРабот;
	Иначе
		СтатусЗаявки = Перечисления.ВКМ_СтатусЗаявкиНаОбслуживание.ЗаявкаВыполнена;
	КонецЕсли;
		
	СообщениеТелеграммБоту = СформироватьСообщениеТелеграммБоту();
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
     	
     	Возврат;
     	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеТелеграммБоту) Тогда 
		СообщениеТелеграммБоту = СтрЗаменить(СообщениеТелеграммБоту,"№Заявки",ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер));
		Если Справочники.ВКМ_УведомленияТелеграмБоту.ДобавитьУведомление(СообщениеТелеграммБоту ) = Неопределено Тогда
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Формирование уведомления в справочнике. Запись не создана.", УровеньЖурналаРегистрации.Ошибка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьЗаполнениеОбъекта(Отказ); 
	

	
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	

	ПроцентОплатыОтРабот = ПолучитьПроцентОплатыОтРабот(Дата, Специалист);
	Если ПроцентОплатыОтРабот = Неопределено Тогда 
		
		ТекстСообщения = СтрШаблон("Документ не проведен. У сотрудника %1 не установлен процент оплаты от выполненных работ.", Специалист);	
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Отказ Тогда	
		Возврат;	
	КонецЕсли; 
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	ВсегоЧасовКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВКМ_СтоимостьЧасаРаботыСпециалиста");
    СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВсегоЧасовКОплатеКлиенту;
    Движение.СуммаКОплате = СуммаКОплатеКлиенту; 
	 
	
КонецПроцедуры


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеОбъекта(Отказ) 
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачалаДействияДоговора, ВКМ_ДатаОкончанияДействияДоговора");
	
	
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
		
		ТекстСообщения = "Документ не проведен. Выбранный договор не предусматривает абонентского обслуживания.";
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);	
		
	Иначе
		
			
		Если РеквизитыДоговора.ВКМ_ДатаНачалаДействияДоговора > Дата Или РеквизитыДоговора.ВКМ_ДатаОкончанияДействияДоговора < Дата Тогда
			
			ТекстСообщения = "Документ не проведен. Выбранный договор не действителен на дату составления текущего документа.";
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);	
			
		КонецЕсли;
		
	КонецЕсли;  
				
КонецПроцедуры

Функция ПолучитьПроцентОплатыОтРабот(Дата, Специалист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|\tВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|\tРегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних\";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ПроцентОтРабот;
		
	Иначе   
		
		Возврат Неопределено; 
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьСообщениеТелеграммБоту()
	
	ТекстСообщения = "";
	Если ЭтоНовый() Тогда
		
		ТекстСообщения = "Создана новая заявка на обслуживание клиента";
		
	Иначе
		
		СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
		"ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист");
		
		ИзмененныеРеквизиты = Новый Структура;
		ИзмененныеРеквизиты.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		ИзмененныеРеквизиты.Вставить("ВремяНачалаРабот", ВремяНачалаРабот);
		ИзмененныеРеквизиты.Вставить("ВремяОкончанияРабот", ВремяОкончанияРабот);
		ИзмененныеРеквизиты.Вставить("Специалист", Специалист);
		
		Если  Не ОбщегоНазначения.ДанныеСовпадают(СтарыеРеквизиты, ИзмененныеРеквизиты) Тогда
			
			ТекстСообщения = "Произошли изменения в заявке на обслуживание клиента";
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ТекстСообщения <> "" Тогда
		
		ТекстСообщения = СтрШаблон("%1 №№Заявки от %2.
						|Контрагент %3.
						|Дата проведения работ запланирована на %4 с %5 по %6.
						|Назначен специалист: %7.",
						ТекстСообщения, 
						Формат(Дата,"ДФ=dd.MM.yyyy"), Клиент, Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаРабот,"ДФ=ЧЧ.мм"),Формат(ВремяОкончанияРабот,"ДФ=ЧЧ.мм"), Специалист);
		
	КонецЕсли;
	
    Возврат ТекстСообщения; 
	
КонецФункции


#КонецОбласти






#КонецЕсли
